export const YES_OR_NO_MAP: Record<string, string> = {
  "1": "Тийм",
  "0": "Үгүй",
};

export const CR105_RATE_MAP1: Record<string, string> = {
  "1": "СТОУС",
  "2": "ЖДААН-ийн СТОУС",
  "3": "УСНББОУС",
};

export const CR105_RATE_MAP2: Record<string, string> = {
  "1": "Аккруэл суурь",
  "2": "Тохируулсан аккруэл суурь",
  "3": "Тохируулсан мөнгөн суурь",
};

export const CR105_RATE_MAP3: Record<string, string> = {
  "1": "Нийтлэг зорилготой",
  "2": "Тусгай зорилготой",
};

export const CR105_RATE_MAP4: Record<string, string> = {
  "1": "Хувьцаа эзэмшигчид, ТУЗ",
  "2": "Төрийн байгууллага",
  "3": "Зээлдүүлэгч/Донор байгууллага",
  "4": "Бусад",
};

export const CR105_RATE_MAP5: Record<string, string> = {
  "1": "Үнэн зөв толилуулгын",
  "2": "Нийцлийн",
};

export const F205_DATA_MAP1: Record<string, string> = {
  "1": "Уламжлалт эрсдэл",
  "2": "Хяналтын эрсдэл",
};
export const F205_DATA_MAP2: Record<string, string> = {
  "0.3": "0.3 - Бага",
  "0.6": "0.6 - Дунд",
  "0.9": "0.9 - Их",
};
export const F205_DATA_MAP3: Record<string, string> = {
  "85": "85%",
  "86": "86%",
  "87": "87%",
  "88": "88%",
  "89": "89%",
  "90": "90%",
  "91": "91%",
  "92": "92%",
  "93": "93%",
  "94": "94%",
  "95": "95%",
  "96": "96%",
  "97": "97%",
};

export const F206_DATA_MAP1: Record<string, string> = {
  "0.5": "0.5%",
  "1.0": "1.0%",
  "1.5": "1.5%",
  "2.0": "2.0%",
};
export const F206_DATA_MAP2: Record<string, string> = {
  "1": "Нийт орлого",
  "2": "Нийт зардал",
  "3": "Нийт хөрөнгө",
  "4": "Цэвэр хөрөнгө",
  "5": "Бусад",
};
export const F206_DATA_MAP3: Record<string, string> = {
  "60": "60%",
  "65": "65%",
  "70": "70%",
  "75": "75%",
  "80": "80%",
};

export const F207_DATA_MAP1: Record<string, string> = {
  "1": "Хяналтад найдах",
  "2": "Биет горим хэрэгжүүлэх",
};
export const F207_DATA_MAP2: Record<string, Record<string, string>> = {
  "1": {
    "1": "Хяналтын сорил",
  },
  "2": {
    "2": "Шинжилгээний горим",
    "3": "Нарийвчилсан сорил",
  },
};

export const F303_DATA_MAP1: Record<string, string> = {
  "0.9": "Найдвартай",
  "1.6": "Дунд зэрэг",
  "3": "Найдваргүй",
};
export const F303_DATA_MAP2: Record<string, string> = {
  "1": "Статистик",
  "2": "Статистикийн бус",
};

export const F304_DATA_MAP1: Record<string, string> = {
  "1": "Алдаа",
  "2": "Зөрчил",
  "3": "Үгүй",
};

export const F305_DATA_MAP1: Record<string, string> = {
  "1": "Материаллаг",
  "2": "Материаллаг бус",
  "3": "Шинж чанарын хувьд материаллаг",
};
export const F305_DATA_MAP2: Record<string, string> = {
  "1": "Дангаараа нөлөө бүхий зүйлийн алдаа",
  "2": "Ердийн бус зүйлийн алдаа",
  "3": "Түүврийн алдаа",
};

export const F306_DATA_MAP1: Record<string, string> = {
  "1": "Математик тооцоололтой холбоотой",
  "2": "НББ-ийн бодлогыг буруу хэрэгжүүлсэнтэй холбоотой",
  "3": "Мэдээллийг тусгахгүй орхигдуулсантай холбоотой",
  "4": "Буруу тусган илэрхийлсэнтэй холбоотой",
};
export const F306_DATA_MAP2: Record<string, string> = {
  "1": "Санхүүгийн байдлын тайлан",
  "2": "Санхүүгийн үр дүнгийн тайлан",
  "3": "Мөнгөн гүйлгээний тайлан",
  "4": "Өмчийн өөрчлөлтийн тайлан",
  "5": "Нэмэлт санхүүжилтийн тайлан",
  "6": "Төсвийн гүйцэтгэлийн тайлан",
};
export const F306_DATA_MAP3: Record<string, string> = {
  "1": "Орлого",
  "2": "Зардал",
  "3": "Цэвэр хөрөнгө/Өмч",
  "4": "Авлага",
  "5": "Бараа материал",
  "6": "Мөнгөн хөрөнгө",
  "7": "Үндсэн хөрөнгө",
  "8": "Өр төлбөр",
  "9": "Урьдчилж гарсан зардал",
  "10": "Нөөцийн бараа",
};

export const F307_DATA_MAP1: Record<string, string> = {
  "1": "Шалгалт",
  "2": "Ажиглалт",
  "3": "Хөндлөнгийн тулган баталгаажуулалт",
  "4": "Дахин тооцоолол",
  "5": "Дахин гүйцэтгэл",
  "6": "Шинжилгээний горимууд",
  "7": "Асуулга",
};

export const F308_DATA_MAP1: Record<string, string> = {
  "1": "Зөвлөмж",
  "2": "Албан шаардлага",
  "3": "Төлбөрийн акт",
  "4": "Хариуцлага тооцох",
  "5": "Хуулийн байгууллагад шилжүүлэх",
};
export const F308_DATA_MAP2: Record<string, Record<string, string>> = {
  "1": {
    "1": "Орлого бүрдүүлэлттэй холбоотой",
    "2": "Төсвийн төлөвлөлт, гүйцэтгэлтэй холбоотой",
    "3": "Нягтлан бодох бүртгэл, тайлагналтай холбоотой",
    "4": "Арвилан хэмнэлт, үр ашиг, үр нөлөөтэй холбоотой",
    "5": "Хууль тогтоомжийн хэрэгжилттэй холбоотой",
    "6": "Дотоод хяналт, хариуцлагатай холбоотой",
    "7": "Худалдан авалттай холбоотой",
    "8": "Зориулалт бус зарцуулалттай холбоотой",
  },
  "2": {
    "9": "Нягтлан бодох бүртгэлийг холбогдох стандарт, хууль тогтоомжийн дагуу зохих ёсоор хөтөлж, баталгаажуулаагүй",
    "10": "Хөрөнгийн тооллогыг холбогдох хууль, тогтоомжид заасны дагуу хийгээгүй, баримтжуулаагүй, баталгаажуулаагүй",
    "11": "Өмч, хөрөнгийг бусдад зүй бусаар ашиглуулсан",
    "12": "Төсвийн хөрөнгийг үр ашиггүй зарцуулсан, зах зээлийн үнээс өндөр үнэтэй эсвэл шаардлагагүй хөрөнгө олж бэлтгэсэн",
    "13": "Төсвийн орлого, зарлагыг буруу тооцоолсон, төсөвт зардлыг хэтрүүлсэн",
    "14": "Төсвийг зориулалт бусаар зарцуулсан",
    "15": "Авлага, өглөгийг тооцоо нийлж баталгаажуулаагүй",
    "16": "Байгуулсан гэрээ, хэлцэл, холбогдох дүрэм, журмыг баримтлаагүй",
    "17": "Төрийн болон орон нутгийн өмчийн хөрөнгөөр бараа, ажил, үйлчилгээ худалдан авах тухай хууль, тогтоомж зөрчсөн нь энэ журмын 4.2.3-т заасан нөхцөл үүсээгүй бол",
    "18": "Аудитаар илэрсэн алдаа, зөрчил, түүнийг арилгахаар өгсөн зөвлөмжийг хугацаанд нь хэрэгжүүлээгүй бол",
    "19": "Хууль, тогтоомж, гэрээ, хэлцэл зөрчсөн алдаа, зөрчлийг таслан зогсоож, давтан гаргуулахгүй байх үр нөлөөтэй гэж үзсэн бусад нөхцөл байдал",
  },
  "3": {
    "20": "Төрийн өмч, хөрөнгийг үндэслэлгүйгээр бусдад хандивласан, үнэ төлбөргүй шилжүүлсэн",
    "21": "Төрийн болон орон нутгийн өмчийн эд хөрөнгийг түрээслүүлсэн, ашиглуулсны төлбөр болон борлуулсны орлогыг дутуу төвлөрүүлсэн, эсхүл төвлөрүүлээгүй",
    "22": "Цалин хөлс, шагнал урамшуулал, тэтгэмжийг зөрүүтэй тооцож олгосон",
    "23": "Төсөвт төвлөрүүлэх ёстой татварын болон татварын бус төсвийн орлогыг төсөвт дутуу төвлөрүүлсэн эсвэл төвлөрүүлээгүй",
    "24": "Бүртгэл, тооцоог зөрүүтэй тооцоолсноос үр дагавар үүссэн",
    "25": "Эрх бүхий этгээдээс тогтоосон норм, нормативыг хэтрүүлэн зарцуулсан",
    "26": "Төрийн болон орон нутгийн өмч, хөрөнгийг дутаасан үрэгдүүлсэн, хууль бусаар ашигласан",
    "27": "Төрийн аудитын тухай хуулийн 21 дүгээр зүйлийн 21.2-т заасан бусад нөхцөл байдал үүссэн",
  },
  "4": {
    "28": "Албан шаардлага, төлбөрийн актыг хугацаанд нь биелүүлээгүй",
    "29": "Аудитын үйл ажиллагаанд саад учруулсан",
    "30": "Санхүүгийн тайлангийн аудитаар сөрөг дүгнэлт авсан",
    "31": "Хуулиар хориглосон үйл ажиллагаа явуулсан",
    "32": "Албан үүргээ биелүүлээгүй",
    "33": "Албан тушаалын бүрэн эрхээ хэтрүүлсэн",
    "34": "Төрийн аудитын байгууллага санхүүгийн тайланд дүгнэлт өгөхөөс татгалзсан",
  },
  "5": {
    "35": "Байгуулсан гэрээ, хэлцэл, холбогдох дүрэм, журмыг баримтлаагүй, хангалтгүй биелүүлсэн",
    "36": "Төсвийг зориулалт бусаар зарцуулсан",
    "37": "Төрийн болон орон нутгийн өмч, хөрөнгийг дутаасан, үрэгдүүлсэн, хууль бусаар ашигласан",
    "38": "Төрийн болон орон нутгийн өмчийн хөрөнгөөр бараа, ажил, үйлчилгээ худалдан авах тухай хууль тогтоомж зөрчсөн",
    "39": "Хуурамч баримт бичиг үйлдсэн, ашигласан",
    "40": "Өөрт олгогдоогүй албан тушаалын бүрэн эрхийг бусдын нэрийн өмнөөс хэрэгжүүлсэн, ашигласан",
    "41": "Эрх мэдэл, албан тушаалын байдлаа урвуулан ашиглаж өөртөө, бусдад давуу байдал бий болгосон",
  },
};
